## Basic Pandas Practice
### Part 1

The file "Purchased_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [36]:
import pandas as pd
#Write your code here
df_data = pd.read_csv("./Data/Purchase_Data.csv")
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [7]:
#Write your code here
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [12]:
#Write you code here
result_1 = df_data.loc[:,"invoice_number":"invoice_time"]
result_1.head()

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16
2    2.020000e+11  7/15/15 12:16
3    2.020000e+11  7/15/15 12:16
4    2.020000e+11  7/15/15 12:16

Slice the first two rows using .loc and store the result in a variable called result_2.

In [13]:
#Write you code here
result_2 = df_data.loc[0:1, :]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [15]:
#Write your code here
result_3 = df_data.loc[0:3, "invoice_number":"category_id"]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [16]:
#Write your code here
result_4 = df_data.loc[[0,4,6], ["invoice_time", "price"]]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number of rows in a variable called num_rows.

In [19]:
#Write you code here
num_rows = df_data.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [21]:
#Write your code here
df_data.tail(1)

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

In [22]:
df_data.loc[num_rows-1, :]

invoice_number        2.02e+11
invoice_time      9/5/15 23:38
store_id                  G619
product_id            23030206
category_id             210101
num_item                     1
price                        2
Name: 5381, dtype: object

### Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [24]:
#Write your code here
avg_price = df_data["price"].mean()
max_price = df_data["price"].max()
avg_price, max_price

(3.1920522110741354, 6.01)

In [26]:
df_data.price.max()

6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [29]:
#Write you code here
means = df_data[["price", "num_item"]].mean()
avg_price = means["price"]
avg_num_items = means["num_item"]
avg_price, avg_num_items

(3.1920522110741354, 1.2983091787439613)

Create a column called "total", which is the product of the price and num_item columns.

In [37]:
#Write your code here
df_data["total"] = df_data["price"] * df_data["num_item"]
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the average price of the three most expensive purchases?

In [38]:
#Write your code here
df_data.sort_values(by="total", ascending=False, inplace=True)
df_data = df_data.reset_index()
df_data.head()
#df_data.loc[0:2, "price"].mean()

,index,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,4510,2.020000e+11,8/30/15 20:21,628,21000362,210301,116.0,3.0,348.0
1,3784,2.020000e+11,8/26/15 17:12,6666,7000294,210101,48.0,1.5,72.0
2,4288,2.020000e+11,8/29/15 8:31,6666,7000294,210101,48.0,1.5,72.0
3,4122,2.020000e+11,8/28/15 11:42,6666,7090097,70301,20.0,3.0,60.0
4,4876,2.020000e+11,9/1/15 21:20,G816,7000300,210101,24.0,2.0,48.0

How many different products are there?

In [41]:
#Write your code here
df_data.product_id.nunique()

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [44]:
#Write your code here
stat = df_data.describe()
stat

,index,invoice_number,product_id,category_id,num_item,price,total
count,5382.000000,5.382000e+03,5.382000e+03,5382.000000,5382.000000,5382.000000,5382.000000
mean,2690.500000,2.020000e+11,8.740911e+06,115465.616499,1.298309,3.192052,3.931808
std,1553.793905,0.000000e+00,5.048294e+06,65448.435316,2.168725,1.652007,5.820520
min,0.000000,2.020000e+11,7.000034e+06,70101.000000,0.500000,0.000000,0.000000
25%,1345.250000,2.020000e+11,7.070884e+06,70201.000000,1.000000,2.000000,2.000000
50%,2690.500000,2.020000e+11,7.071096e+06,70401.000000,1.000000,2.500000,3.000000
75%,4035.750000,2.020000e+11,7.090592e+06,210101.000000,1.000000,5.000000,5.000000
max,5381.000000,2.020000e+11,3.000077e+07,210301.000000,116.000000,6.010000,348.000000

In [45]:
stat.loc["mean", "total"] - stat.loc["50%", "total"]

0.9318078781127812

Use the drop() method to delete the column total from the dataframe df_data.

In [46]:
#Write your code here
df_data.drop("total", axis=1, inplace=True)
df_data.head()

,index,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,4510,2.020000e+11,8/30/15 20:21,628,21000362,210301,116.0,3.0
1,3784,2.020000e+11,8/26/15 17:12,6666,7000294,210101,48.0,1.5
2,4288,2.020000e+11,8/29/15 8:31,6666,7000294,210101,48.0,1.5
3,4122,2.020000e+11,8/28/15 11:42,6666,7090097,70301,20.0,3.0
4,4876,2.020000e+11,9/1/15 21:20,G816,7000300,210101,24.0,2.0

Let's dig a little deeper into the data set and answer some basic question.

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [47]:
#Write your code here
df_data["time"] = pd.to_datetime(df_data["invoice_time"])
df_data.head()

,index,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,time
0,4510,2.020000e+11,8/30/15 20:21,628,21000362,210301,116.0,3.0,2015-08-30 20:21:00
1,3784,2.020000e+11,8/26/15 17:12,6666,7000294,210101,48.0,1.5,2015-08-26 17:12:00
2,4288,2.020000e+11,8/29/15 8:31,6666,7000294,210101,48.0,1.5,2015-08-29 08:31:00
3,4122,2.020000e+11,8/28/15 11:42,6666,7090097,70301,20.0,3.0,2015-08-28 11:42:00
4,4876,2.020000e+11,9/1/15 21:20,G816,7000300,210101,24.0,2.0,2015-09-01 21:20:00

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [59]:
#Write your code here
df_data["DOW"] = df_data.time.dt.weekday_name
df_data["Month"] = df_data.time.dt.month

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [57]:
#Write your code here
num_purchases_wed = df_data.DOW.value_counts()["Wednesday"]
num_purchases_wed

959

In [58]:
df_data.DOW.value_counts()

Wednesday    959
Friday       906
Thursday     828
Saturday     800
Tuesday      666
Monday       616
Sunday       607
Name: DOW, dtype: int64